//    Copyright 2018 cclin
//
//    Licensed under the Apache License, Version 2.0 (the "License");
//    you may not use this file except in compliance with the License.
//    You may obtain a copy of the License at
//
//        http://www.apache.org/licenses/LICENSE-2.0
//
//    Unless required by applicable law or agreed to in writing, software
//    distributed under the License is distributed on an "AS IS" BASIS,
//    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//    See the License for the specific language governing permissions and
//    limitations under the License.
package ipttmrts

import (
	"testing"
)

func TestFindNearTaipeiMRTStation(t *testing.T) {
	testcases := []struct {
		poi       string
		latitude  float64
		longitude float64
		station   string
	}{
		{"誠正國中", 25.054361, 121.619107, "南港展覽館"},
		{"台北市極限運動訓練中心", 25.051534, 121.607226, "南港"},
		{"昆陽牛肉麵", 25.049899, 121.593941, "昆陽"},
		{"潮肉壽喜燒", 25.045164, 121.581496, "後山埤"},
		{"橘象。泰早安", 25.041128, 121.578110, "永春"},
		{"BELLAVITA 寶麗廣塲", 25.039713, 121.567753, "市政府"},
		{"松山文創園區", 25.043859, 121.560657, "國父紀念館"},
		{"明曜百貨公司", 25.041360, 121.552038, "忠孝敦化"},
		{"湛盧咖啡忠孝館", 25.041363, 121.544956, "忠孝復興"},
		{"老樹咖啡", 25.040738, 121.532716, "忠孝新生"},
		{"比丘手作吐司早午餐", 25.044215, 121.524841, "善導寺"},
		{"京站時尚廣場", 25.049118, 121.518119, "台北車站"},
		{"西門紅樓", 25.042038, 121.506861, "西門"},
		{"龍山寺", 25.037188, 121.499907, "龍山寺"},
		{"石頭肉圓", 25.031059, 121.474477, "江子翠"},
		{"猜咖啡", 25.022832, 121.468646, "新埔"},
		{"PONPIE 澎派", 25.014212, 121.459594, "板橋"},
		{"愛烤愛對囉板橋店", 25.008788, 121.460395, "府中"},
		{"OEC美味CEO早午餐店", 24.995531, 121.450523, "亞東醫院"},
		{"啖餅坊手工蛋餅專賣店", 24.986126, 121.450429, "海山"},
		{"饗饌台灣小吃土城店", 24.974043, 121.444955, "土城"},
		{"石尚自然史博物館", 24.968706, 121.436922, "永寧"},
		{"鴻海精密工業頂埔廠", 24.958685, 121.419378, "頂埔"},
		{"淡水文化園區", 25.165916, 121.446997, "淡水"},
		{"紅樹林生態樂園", 25.156957, 121.458116, "紅樹林"},
		{"Treeman Cafe 樹男咖啡", 25.137593, 121.462056, "竹圍"},
		{"Luguo Cafe 爐鍋咖啡", 25.124340, 121.466779, "關渡"},
		{"台北藝術大學", 25.131934, 121.469735, "忠義"},
		{"胖老闆", 25.138361, 121.486186, "復興崗"},
		{"北投黑金魚咖啡館", 25.132735, 121.498732, "北投"},
		{"北投老爺酒店", 25.137510, 121.503725, "新北投"},
		{"Burger Su Veggie", 25.124797, 121.500141, "奇岩"},
		{"鏢窩", 25.121267, 121.505528, "唭哩岸"},
		{"水龜伯古早味", 25.116924, 121.515820, "石牌"},
		{"Wonderland Cafe 綠野仙蹤", 25.111046, 121.520751, "明德"},
		{"元氣貓主題咖啡館", 25.105087, 121.521631, "芝山"},
		{"寶飽煲", 25.095645, 121.525652, "士林"},
		{"草原風蒙古火鍋", 25.083700, 121.522962, "劍潭"},
		{"神農市場", 25.070045, 121.522053, "圓山"},
		{"下港吔羊肉專賣店", 25.061099, 121.520937, "民權西路"},
		{"馬偕紀念醫院", 25.058701, 121.522219, "雙連"},
		{"米朗琪咖啡館", 25.053258, 121.520877, "中山"},
		{"台大醫院", 25.040706, 121.518980, "台大醫院"},
		{"中正紀念堂", 25.034683, 121.521802, "中正紀念堂"},
		{"鼎泰豐總店", 25.033505, 121.530118, "東門"},
		{"大安森林公園滑輪場", 25.032477, 121.535814, "大安森林公園"},
		{"窩著咖啡", 25.032549, 121.544547, "大安"},
		{"後院", 25.032038, 121.552868, "信義安和"},
		{"台北101", 25.033690, 121.564779, "台北101/世貿"},
		{"台北信義威秀影城", 25.035612, 121.567267, "象山"},
		{"中國信託金融園區", 25.059200, 121.615447, "南港軟體園區"},
		{"哈拉影城", 25.070581, 121.611303, "東湖"},
		{"康寧醫院", 25.076035, 121.608987, "葫洲"},
		{"Triple Cafe", 25.083254, 121.604130, "大湖公園"},
		{"七海酒樓", 25.083039, 121.593292, "內湖"},
		{"內湖吳家包子店", 25.077176, 121.581785, "文德"},
		{"法式微笑紅豆餅", 25.079065, 121.578250, "港墘"},
		{"覺旅咖啡西湖店", 25.080559, 121.568211, "西湖"},
		{"豐 FOOD 海陸百匯", 25.083736, 121.554919, "劍南路"},
		{"KUMA 酷馬廚房", 25.081160, 121.544986, "大直"},
		{"松山機場觀景台", 25.064246, 121.550822, "松山機場"},
		{"GaBee 咖啡店", 25.059278, 121.546249, "中山國中"},
		{"慶城海南雞飯", 25.052985, 121.545549, "南京復興"},
		{"SuperVit 營養師的光合廚房", 25.025775, 121.544877, "科技大樓"},
		{"築地平價日式料理", 25.024421, 121.553295, "六張犁"},
		{"二五街角精緻咖啡", 25.018600, 121.558238, "麟光"},
		{"A Mini Bistro 小館", 25.006807, 121.559101, "辛亥"},
		{"台灣警察專科學校", 24.998059, 121.559256, "萬芳醫院"},
		{"米絲阿樂局調酒專賣", 24.998589, 121.568616, "萬芳社區"},
		{"媽咪廚房", 24.999042, 121.574143, "木柵"},
		{"台北市立動物園", 24.997200, 121.585155, "動物園"},
		{"饒河夜市", 25.050979, 121.577526, "松山"},
		{"陳家涼麵", 25.052861, 121.560759, "南京三民"},
		{"台北小巨蛋", 25.051516, 121.549749, "台北小巨蛋"},
		{"Music Corner 角落音樂餐廳", 25.051660, 121.536353, "松江南京"},
		{"台北府城北門", 25.047767, 121.511232, "北門"},
		{"中華民國內政部移民署", 25.036020, 121.508284, "小南門"},
		{"小路上。藝文空間", 25.026155, 121.524458, "古亭"},
		{"參差 餘波未了", 25.020273, 121.527306, "台電大樓"},
		{"陳三鼎黑糖青蛙鮮奶創始店", 25.015724, 121.532457, "公館"},
		{"丐幫滷味萬龍分舵", 25.000974, 121.539577, "萬隆"},
		{"文山劇場", 24.992141, 121.541111, "景美"},
		{"乾隆坊港式酒樓", 24.983086, 121.539240, "大坪林"},
		{"陶然日式小火鍋", 24.974597, 121.542222, "七張"},
		{"淞月湯包菜飯館", 24.967792, 121.541000, "新店區公所"},
		{"碧潭風景區", 24.956000, 121.536504, "新店"},
		{"興南夜市", 24.990023, 121.510741, "南勢角"},
		{"私藏不藏私", 24.994542, 121.505751, "景安"},
		{"瞇瞇眼美式蔬食餐廳", 25.002834, 121.512364, "永安市場"},
		{"狠生氣日式燒肉", 25.016351, 121.516385, "頂溪"},
		{"行天宮", 25.063126, 121.533914, "行天宮"},
		{"肥猫漁夫", 25.064128, 121.525383, "中山國小"},
		{"延三夜市", 25.063398, 121.511181, "大橋頭"},
		{"肉多多火鍋", 25.070853, 121.494799, "三重國小"},
		{"粥棧", 25.077063, 121.483776, "三和國中"},
		{"徐匯廣場", 25.080548, 121.480270, "徐匯中學"},
		{"大象切仔麵", 25.085369, 121.472546, "三民高中"},
		{"摩根時尚旅館", 25.090294, 121.464814, "蘆洲"},
		{"餓店碳烤吐司", 25.063686, 121.499181, "台北橋"},
		{"哩厚嘎嗶", 25.060105, 121.490385, "菜寮"},
		{"清和餐廳", 25.055698, 121.483100, "三重"},
		{"高麗國韓式泡菜", 25.047206, 121.472169, "先嗇宮"},
		{"鑫羊羊肉爐", 25.042074, 121.459682, "頭前庄"},
		{"老順香糕餅店", 25.034087, 121.452309, "新莊"},
		{"天主教輔仁大學", 25.036551, 121.432363, "輔大"},
		{"窩義下義式廚坊", 25.028909, 121.421805, "丹鳳"},
		{"米炭火燒肉小酒館", 25.022313, 121.412976, "迴龍"},
	}

	for _, tc := range testcases {
		tc := tc
		t.Run(tc.poi, func(t *testing.T) {
			t.Parallel()
			station := FindNearTaipeiMRTStation(tc.latitude, tc.longitude)
			if station.NameTW != tc.station {
				t.Fatalf("expected %s | got %s", tc.station, station.NameTW)
			}
		})
	}
}

func BenchmarkFindNearTaipeiMRTStation(b *testing.B) {
	benchmarks := []struct {
		poi       string
		latitude  float64
		longitude float64
		station   string
	}{
		{"誠正國中", 25.054361, 121.619107, "南港展覽館"},
		{"中國信託金融園區", 25.059200, 121.615447, "南港軟體園區"},
		{"哈拉影城", 25.070581, 121.611303, "東湖"},
		{"康寧醫院", 25.076035, 121.608987, "葫洲"},
		{"Triple Cafe", 25.083254, 121.604130, "大湖公園"},
		{"七海酒樓", 25.083039, 121.593292, "內湖"},
	}
	for _, bm := range benchmarks {
		bm := bm
		b.Run(bm.poi, func(b *testing.B) {
			for i := 0; i < b.N; i++ {
				FindNearTaipeiMRTStation(bm.latitude, bm.longitude)
			}
		})
	}
}
