package main

import (
	"testing"
)

func TestFindNearTaipeiMRTStation(t *testing.T) {
	testcases := []struct {
		poi       string
		latitude  float64
		longitude float64
		station   string
	}{
		{"誠正國中", 25.054361, 121.619107, "南港展覽館"},
		{"台北市極限運動訓練中心", 25.051534, 121.607226, "南港"},
		{"昆陽牛肉麵", 25.049899, 121.593941, "昆陽"},
		{"潮肉壽喜燒", 25.045164, 121.581496, "後山埤"},
		{"橘象。泰早安", 25.041128, 121.578110, "永春"},
		{"BELLAVITA 寶麗廣塲", 25.039713, 121.567753, "市政府"},
		{"松山文創園區", 25.043859, 121.560657, "國父紀念館"},
		{"明曜百貨公司", 25.041360, 121.552038, "忠孝敦化"},
		{"湛盧咖啡忠孝館", 25.041363, 121.544956, "忠孝復興"},
		{"老樹咖啡", 25.040738, 121.532716, "忠孝新生"},
		{"比丘手作吐司早午餐", 25.044215, 121.524841, "善導寺"},
		{"京站時尚廣場", 25.049118, 121.518119, "台北車站"},
		{"西門紅樓", 25.042038, 121.506861, "西門"},
		{"龍山寺", 25.037188, 121.499907, "龍山寺"},
		{"石頭肉圓", 25.031059, 121.474477, "江子翠"},
		{"猜咖啡", 25.022832, 121.468646, "新埔"},
		{"PONPIE 澎派", 25.014212, 121.459594, "板橋"},
		{"愛烤愛對囉板橋店", 25.008788, 121.460395, "府中"},
		{"OEC美味CEO早午餐店", 24.995531, 121.450523, "亞東醫院"},
		{"啖餅坊手工蛋餅專賣店", 24.986126, 121.450429, "海山"},
		{"饗饌台灣小吃土城店", 24.974043, 121.444955, "土城"},
		{"石尚自然史博物館", 24.968706, 121.436922, "永寧"},
		{"鴻海精密工業頂埔廠", 24.958685, 121.419378, "頂埔"},
		{"淡水文化園區", 25.165916, 121.446997, "淡水"},
		{"紅樹林生態樂園", 25.156957, 121.458116, "紅樹林"},
		{"Treeman Cafe 樹男咖啡", 25.137593, 121.462056, "竹圍"},
		{"Luguo Cafe 爐鍋咖啡", 25.124340, 121.466779, "關渡"},
		{"台北藝術大學", 25.131934, 121.469735, "忠義"},
		{"胖老闆", 25.138361, 121.486186, "復興崗"},
		{"北投黑金魚咖啡館", 25.132735, 121.498732, "北投"},
		{"北投老爺酒店", 25.137510, 121.503725, "新北投"},
		{"Burger Su Veggie", 25.124797, 121.500141, "奇岩"},
		{"鏢窩", 25.121267, 121.505528, "唭哩岸"},
		{"水龜伯古早味", 25.116924, 121.515820, "石牌"},
		{"Wonderland Cafe 綠野仙蹤", 25.111046, 121.520751, "明德"},
		{"元氣貓主題咖啡館", 25.105087, 121.521631, "芝山"},
		{"寶飽煲", 25.095645, 121.525652, "士林"},
		{"草原風蒙古火鍋", 25.083700, 121.522962, "劍潭"},
		{"神農市場", 25.070045, 121.522053, "圓山"},
		{"下港吔羊肉專賣店", 25.061099, 121.520937, "民權西路"},
		{"馬偕紀念醫院", 25.058701, 121.522219, "雙連"},
		{"米朗琪咖啡館", 25.053258, 121.520877, "中山"},
		{"台大醫院", 25.040706, 121.518980, "台大醫院"},
		{"中正紀念堂", 25.034683, 121.521802, "中正紀念堂"},
		{"鼎泰豐總店", 25.033505, 121.530118, "東門"},
		{"大安森林公園滑輪場", 25.032477, 121.535814, "大安森林公園"},
		{"窩著咖啡", 25.032549, 121.544547, "大安"},
		{"後院", 25.032038, 121.552868, "信義安和"},
		{"台北101", 25.033690, 121.564779, "台北101/世貿"},
		{"台北信義威秀影城", 25.035612, 121.567267, "象山"},
		{"中國信託金融園區", 25.059200, 121.615447, "南港軟體園區"},
		{"哈拉影城", 25.070581, 121.611303, "東湖"},
		{"康寧醫院", 25.076035, 121.608987, "葫洲"},
		{"Triple Cafe", 25.083254, 121.604130, "大湖公園"},
		{"七海酒樓", 25.083039, 121.593292, "內湖"},
		{"", 0, 0, "文德"},
		{"", 0, 0, "港墘"},
		{"", 0, 0, "西湖"},
		{"", 0, 0, "劍南路"},
		{"", 0, 0, "大直"},
		{"", 0, 0, "松山機場"},
		{"", 0, 0, "中山國中"},
		{"", 0, 0, "南京復興"},
		{"", 0, 0, "科技大樓"},
		{"", 0, 0, "六張犁"},
		{"", 0, 0, "麟光"},
		{"", 0, 0, "辛亥"},
		{"", 0, 0, "萬芳醫院"},
		{"", 0, 0, "萬芳社區"},
		{"", 0, 0, "木柵"},
		{"", 0, 0, "動物園"},
		{"", 0, 0, "松山"},
		{"", 0, 0, "南京三民"},
		{"", 0, 0, "台北小巨蛋"},
		{"", 0, 0, "松江南京"},
		{"", 0, 0, "北門"},
		{"", 0, 0, "小南門"},
		{"", 0, 0, "中正紀念堂"},
		{"", 0, 0, "古亭"},
		{"", 0, 0, "台電大樓"},
		{"", 0, 0, "公館"},
		{"", 0, 0, "萬隆"},
		{"", 0, 0, "景美"},
		{"", 0, 0, "大坪林"},
		{"", 0, 0, "七張"},
		{"", 0, 0, "新店區公所"},
		{"", 0, 0, "新店"},
		{"", 0, 0, "南勢角"},
		{"", 0, 0, "景安"},
		{"", 0, 0, "永安市場"},
		{"", 0, 0, "頂溪"},
		{"", 0, 0, "行天宮"},
		{"", 0, 0, "中山國小"},
		{"", 0, 0, "大橋頭"},
		{"", 0, 0, "三重國小"},
		{"", 0, 0, "三和國中"},
		{"", 0, 0, "徐匯中學"},
		{"", 0, 0, "三民高中"},
		{"", 0, 0, "蘆洲"},
		{"", 0, 0, "台北橋"},
		{"", 0, 0, "菜寮"},
		{"", 0, 0, "三重"},
		{"", 0, 0, "先嗇宮"},
		{"", 0, 0, "頭前庄"},
		{"", 0, 0, "新莊"},
		{"", 0, 0, "輔大"},
		{"", 0, 0, "丹鳳"},
		{"", 0, 0, "迴龍"},
	}

	for _, tc := range testcases {
		tc := tc
		t.Run(tc.poi, func(t *testing.T) {
			station := findNearTaipeiMRTStation(tc.latitude, tc.longitude)
			if station.NameTW != tc.station {
				t.Fatalf("expected %s | got %s", tc.station, station.NameTW)
			}
		})
	}
}

func BenchmarkFindNearTaipeiMRTStation(b *testing.B) {
	benchmarks := []struct {
		poi       string
		latitude  float64
		longitude float64
		station   string
	}{
		{"誠正國中", 25.054361, 121.619107, "南港展覽館"},
		{"中國信託金融園區", 25.059200, 121.615447, "南港軟體園區"},
		{"哈拉影城", 25.070581, 121.611303, "東湖"},
		{"康寧醫院", 25.076035, 121.608987, "葫洲"},
		{"Triple Cafe", 25.083254, 121.604130, "大湖公園"},
		{"七海酒樓", 25.083039, 121.593292, "內湖"},
	}
	for _, bm := range benchmarks {
		bm := bm
		b.Run(bm.poi, func(b *testing.B) {
			for i := 0; i < b.N; i++ {
				findNearTaipeiMRTStation(bm.latitude, bm.longitude)
			}
		})
	}
}
